# Отчет по лабораторной работе № 9
## по курсу "Прикладная математика и информатика"

Студент группы М8О-108Б-23 Явметдинов Максим Русланович

Работа выполнена 

Преподаватель: каф. 806 Севастьянов Виктор Сергеевич

1. **Тема**: Разработка программы на языке программирования C с использованием рекуррентных соотношений и итеративного характера для моделирования движения точки в целочисленной системе координат.
2. **Цель работы**: Создание, компиляция и выполнение программы на языке C, моделирующей движение точки в заданной области плоскости с использованием рекуррентных соотношений и динамического параметра.
3. **Идея, метод, алгоритм решения задачи**: 
- Написать программу на языке C с использованием рекуррентных соотношений для вычисления координат точки.
- Добавить условия для проверки попадания точки в заданную область плоскости.
- Организовать вывод результатов движения, включая время попадания, конечные координаты точки и значение динамического параметра.
4. **Сценарий выполнения работы**: 
- Установить необходимые компоненты, такие как компилятор GCC.
- Написать программу на языке C с использованием предложенных рекуррентных соотношений.
- Создать Makefile для упрощения процесса компиляции и выполнения программы.
- Запустить make для компиляции и выполнения программы.
5. **Протокол**:
Программа:
```c
#include <stdio.h>
#include <stdlib.h>
#include <math.h>

int sign(int x) {
    return (x > 0) - (x < 0);
}

int min(int x, int y) {
    if (x < y) {
        return x;
    } else {
        return y;
    }
}

int max(int x, int y) {
    if (x > y) {
        return x;
    } else {
        return y;
    }
}

int mod(int a, int b){
    return a - floor(a / b) * b;
}

int main() {
    int i, j, l, k, hit;
    i = -25;
    j = -9;
    l = -8;
    hit = -1;

    //printf("(%d, %d)\n", i, j);

    for (k = 1; k <= 50; k++) {
        i = mod((abs(i - j) * l - abs(j - l) * i + abs(i - l) * j), 20) - k;
        j = mod(min(i, j) * max(j, l) * min(i, l), 25) + 5 * sign(i) + k;
        l = abs(l) * sign(i - j) - abs(i) * sign(j - l) + abs(j) * sign(i - l);

        //printf("(%d, %d)\n", i, j);

        if ((i + j + 10 >= 0) && (i + j + 20 <= 0)) {
            hit = k;
            break;
        }
    }

    if (hit != -1) {
        printf("попал в %d\n", hit);
    } else {
        printf("промах\n");
    }

    printf("конечные: %d %d %d\n", i, j, l);
    printf("динам. параметр: %d\n", l);

    return 0;
}
```
Makefile:
```makefile
all:
    gcc ./newprog.c -o newprog.exe
    ./newprog.exe
    rm newprog.exe
```
6. **Выводы**: Эта работа была важной, так как я освоил основы программирования на языке C, отладку программ на языке С, создание Makefile для упрощения процесса компиляции и выполнения программы. Полученные навыки будут полезны в дальнейших задачах и проектах на языке C.
7. **Итог**: Я освоил основы языка С, отладку программ на С и создание Makefile.