# Отчет по лабораторной работе № 8
## по курсу "Прикладная математика и информатика"

Студент группы М8О-108Б-23 Явметдинов Максим Русланович

Работа выполнена 

Преподаватель: каф. 806 Севастьянов Виктор Сергеевич

1. **Тема**: Системы программирования на языке Си
2. **Цель работы**: Скомпилировать и запустить программу на языке Си
3. **Идея, метод, алгоритм решения задачи**: 
- Написать программу
- Скомпилировать программу
- Запустить программу
4. **Сценарий выполнения работы**: 
- Установить gcc
- Написать код и makefile
- Запустить make
5. **Протокол**:
```
~/Desktop/lab8/temp $ make
gcc --std=c99 --pedantic -o hello hello.c
./hello
Hello, Charles!
rm hello.exe
~/Desktop/lab8/temp $ cat Makefile
all:
        gcc --std=c99 --pedantic -o hello hello.c
        ./hello
        rm hello.exe
~/Desktop/lab8/temp $ cat hello.c
#include <stdio.h>

int main() {
    printf("Hello, Charles!\n");
    return 0;
}
~/Desktop/lab8/temp $
```
6. **Выводы**: Эта работа была важной, так как я установил и скомпилировал программу на Си, и это поможет мне в выполнении будущих задач и работ на языке Си. Я также смог создать Makefile, который упрощает запуск программы.
7. **Итог**: Я научился пользоваться компилятором gcc, make, а также создавать Makefile.
